"Update" = "更新";
"Length:" = "长短：";
"Characters" = "人物";
"Alphanumeric" = "字母数字";
"Frequency" = "频次";
"Groups" = "分组";
"Length" = "长短";
"Weight" = "重量";
"Word" = "词汇";
"Search" = "检索";
"Similar" = "相似";
"Analogy" = "类比";
"Quality of results" = "结果质量";
"#" = "#";
